app/controllers/products_controller.rb

INSERT INTO "products" ("name", "price", "created_at", "updated_at", "inventory", "description") VALUES (?, ?, ?, ?, ?, ?)  [["name", "test"], ["price", 13], ["created_at", "2019-04-20 12:53:41.132459"], ["updated_at", "2019-04-20 12:53:41.132459"], ["inventory", 5], ["description", "a thing i made"]]
---
  def create
    @product = Product.create(product_params)